Config/InformationRegisters/UserActionsHistory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>UserActionsHistory</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Changes</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
						<v8:Type>cfg:DocumentRef.ClientDataScans</v8:Type>
						<v8:Type>cfg:DocumentRef.Storno</v8:Type>
						<v8:Type>cfg:DocumentRef.RecordPhoneCall</v8:Type>
						<v8:Type>cfg:CatalogRef.SMSTemplates</v8:Type>
						<v8:Type>cfg:DocumentRef.Settlement</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
						<v8:Type>cfg:DocumentRef.Payment</v8:Type>
						<v8:Type>cfg:DocumentRef.Return</v8:Type>
						<v8:Type>cfg:DocumentRef.RecordRoomService</v8:Type>
						<v8:Type>cfg:CatalogRef.AccommodationTemplates</v8:Type>
						<v8:Type>cfg:DocumentRef.CashOutcome</v8:Type>
						<v8:Type>cfg:DocumentRef.EmployeeOperation</v8:Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
						<v8:Type>cfg:DocumentRef.Order</v8:Type>
						<v8:Type>cfg:DocumentRef.SMSDelivery</v8:Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
						<v8:Type>cfg:CatalogRef.ServiceGroups</v8:Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
						<v8:Type>cfg:DocumentRef.BonusesPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.Charge</v8:Type>
						<v8:Type>cfg:DocumentRef.CloseOfPeriod</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomBlock</v8:Type>
						<v8:Type>cfg:CatalogRef.ServicePackages</v8:Type>
						<v8:Type>cfg:DocumentRef.AddRoom</v8:Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomTypeClasses</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomStatuses</v8:Type>
						<v8:Type>cfg:DocumentRef.CloseOfCashRegisterDay</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomQuota</v8:Type>
						<v8:Type>cfg:DocumentRef.RoomInterfaceStatus</v8:Type>
						<v8:Type>cfg:DocumentRef.SetPriceTagRanges</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomRatePrices</v8:Type>
						<v8:Type>cfg:CatalogRef.CreditCards</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomRateFormulas</v8:Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
						<v8:Type>cfg:CatalogRef.HotelProducts</v8:Type>
						<v8:Type>cfg:DocumentRef.ProformaInvoice</v8:Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
						<v8:Type>cfg:DocumentRef.Preauthorisation</v8:Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
						<v8:Type>cfg:CatalogRef.PermissionGroups</v8:Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomBlockTypes</v8:Type>
						<v8:Type>cfg:DocumentRef.ForeignerRegistryRecord</v8:Type>
						<v8:Type>cfg:DocumentRef.ChangeRoom</v8:Type>
						<v8:Type>cfg:CatalogRef.RoomRates</v8:Type>
						<v8:Type>cfg:CatalogRef.AccommodationStatuses</v8:Type>
						<v8:Type>cfg:DocumentRef.ResourceReservation</v8:Type>
						<v8:Type>cfg:CatalogRef.Resources</v8:Type>
						<v8:Type>cfg:CatalogRef.AccommodationTypes</v8:Type>
						<v8:Type>cfg:DocumentRef.DepositTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.ChargeTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.BonusesOperation</v8:Type>
						<v8:Type>cfg:CatalogRef.ClientTypes</v8:Type>
						<v8:Type>cfg:DocumentRef.DebitNote</v8:Type>
						<v8:Type>cfg:CatalogRef.ReservationStatuses</v8:Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
						<v8:Type>cfg:DocumentRef.OperationSchedule</v8:Type>
						<v8:Type>cfg:CatalogRef.QuantityCalculationRules</v8:Type>
						<v8:Type>cfg:DocumentRef.CashIncome</v8:Type>
						<v8:Type>cfg:CatalogRef.IdentificationCards</v8:Type>
						<v8:Type>cfg:CatalogRef.ResourceReservationStatuses</v8:Type>
						<v8:Type>cfg:DocumentRef.ServiceRegistration</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerPayment</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ConnectedDevices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ConnectedDevices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IsActive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Workstation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Workstations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DeviceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DeviceTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DeviceSettings</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ImageScannerConnectionParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.RibbonPrinterConnectionParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.BarcodesScannerConnectionParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.CreditCardsProcessingSystemParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.CustomerDisplayParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.DoorLockSystemParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.IdentityCardsSystemParameters</v8:Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
						<v8:Type>cfg:CatalogRef.CashAcceptorsConnectionParameters</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/DoorLockSystems.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>DoorLockSystems</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Adel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Amadeus</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AssaAbloyHospitality</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bonwin</Name>
					<Comment>Bonwin</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BonwinAutonomous</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cisa</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FHBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FIAS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HAFELE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Hoist</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HSU</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocks</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>iLocksOnline</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InhovaMagnetic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InhovaProximity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KabaIlco</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KabaSaflok</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Locstar</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Motolong</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NORWEQMF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Novilock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OmniTec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT22</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT24</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnityHT28</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita4X</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Orbita5X</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OZLocks</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>proUSB</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SaltoHotel</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TimeLox2300</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ttLock</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCard2100</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCard2800</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCardDavinci</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VingCardVision</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Xeeder</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/AccomodationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AccomodationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Room</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Beds</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Together</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdditionalBed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/DeviceTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>DeviceTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CashRegisters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DoorLockSystemParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CreditCardsProcessingSystemParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDisplayParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ImagesScannerConnectionParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IdentityCardsProcessingSystemParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BarcodesScannerConnectionParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RibbonPrinterConnectionParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashAcceptorsConnectionParameters</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/DataProcessors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>DataProcessors</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IsExternal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Processing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalDataProcessors</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StaticParameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DynamicParameters</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PermissionGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PermissionGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsSystem</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotFillHotelFromSessionParameters</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PermissionGroups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PermissionGroup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PermissionGroups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonForms/tcIssueKeyCard/Ext/Form/Module.bsl
#Region FormEventHandlers

// --------------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	DoorLockSystem = Undefined;
	Workstation = SessionParameters.CurrentWorkstation;
	If Parameters.Property("ParametersKeyCard") And TypeOf(Parameters.ParametersKeyCard) = Type("Structure") Then
		FillPropertyValues(ThisObject, Parameters.ParametersKeyCard); // ParametersKeyCard could have DoorLockSystem item inside 
		If ValueIsFilled(Folio) Then
			FolioNumber = Folio.Number;
		EndIf;
	EndIf;
	NumberOfKeys = 1;
	OneGuestMode = False;
	If Parameters.Property("ParametersOneGuestMode") And 
		TypeOf(Parameters.ParametersOneGuestMode) = Type("Boolean") And 
		Parameters.ParametersOneGuestMode Then
		OneGuestMode = True;
	EndIf;
EndProcedure // OnCreateAtServer

// --------------------------------------------------------------------------------
&AtClient
Procedure OnOpen(pCancel)
	// Get door lock system attached to this workstation
	If Not ValueIsFilled(DoorLockSystem) Then
		vDoorLockSystemsArray = GetDoorLockSystems(Workstation, Room);
		If vDoorLockSystemsArray.Count() > 1 And ValueIsFilled(ParentDoc) Then
			vParams = New Structure("DoorLockSystemsArray, ParentDoc, ParametersOneGuestMode", vDoorLockSystemsArray, ParentDoc, OneGuestMode);
			OpenForm("CommonForm.tcDoorLockSystemChoiceForm", vParams, FormOwner, Workstation);
			pCancel = True;
			Return;
		ElsIf vDoorLockSystemsArray.Count() = 1 Then 
			DoorLockSystem = vDoorLockSystemsArray[0];
		EndIf;
	EndIf;
	If Not ValueIsFilled(DoorLockSystem) Then
		If ValueIsFilled(Workstation) And tcOnServer.cmGetAttributeByRef(Workstation, "HasConnectionToDoorLockSystem") Then
			DoorLockSystem = tcOnServer.cmGetAttributeByRef(Workstation, "DoorLockSystemParameters");
		EndIf;
	EndIf;
	If ValueIsFilled(DoorLockSystem) Then
		// Check if we have to open special form or use this one
		vInteractionParameters = tcOnServer.cmGetAttributeByRef(DoorLockSystem, "InteractionParameters"); 	
		If ValueIsFilled(vInteractionParameters) Then
			vDataProcessor = tcOnServer.cmGetAttributeByRef(vInteractionParameters, "DataProcessor");
			If ValueIsFilled(vDataProcessor) Then
				vDataProcessorName = GetDataProcessorName(vDataProcessor);
				If vDataProcessorName <> Undefined And ValueIsFilled(ParentDoc) Then
					vParametersKeyCard = tcOnServer.cmFillParametersKeyCard(ParentDoc);
					vParams = New Structure();
					vParams.Insert("ParametersKeyCard", vParametersKeyCard);
					vParams.Insert("ParametersOneGuestMode", OneGuestMode);
					vParams.Insert("DataProcessor", vDataProcessor);
					vParams.Insert("InteractionParameters", vInteractionParameters);
					vParams.ParametersKeyCard.Insert("DoorLockSystemParameters", DoorLockSystem);
					OpenForm(vDataProcessorName, vParams, ThisObject.FormOwner, Workstation, , , , FormWindowOpeningMode.LockOwnerWindow);
					pCancel = True;
					Return;
				EndIf;
			EndIf;
		EndIf;
		// Continue to open this form
		vDoorLockSystemType = tcOnServer.cmGetAttributeByRef(DoorLockSystem, "DoorLockSystemType");
		If vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Orbita5X") Or 
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Orbita4X") Then
			Items.AddKey.Visible = False;
			Items.NumberOfKeys.Visible = False;
		ElsIf vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.BonwinAutonomous") Or 
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocks") Or 
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.proUSB") Then
			Items.NumberOfKeys.Visible = False;	
		Else
			If ValueIsFilled(Folio) Then
				If Not ValueIsFilled(ParentDoc) Then
					ParentDoc = tcOnServer.cmGetAttributeByRef(Folio, "ParentDoc");
				EndIf;
				If Not OneGuestMode Then
					If ValueIsFilled(ParentDoc) Then
						If TypeOf(ParentDoc) = Type("DocumentRef.Accommodation") Or 
							TypeOf(ParentDoc) = Type("DocumentRef.Reservation") Then
							vAccommodationTemplate = tcOnServer.cmGetAttributeByRef(ParentDoc, "AccommodationTemplate");
							If ValueIsFilled(vAccommodationTemplate) Then
								vNumberOfAdults = tcOnServer.cmGetAttributeByRef(vAccommodationTemplate, "NumberOfAdults");
								vNumberOfTeenagers = tcOnServer.cmGetAttributeByRef(vAccommodationTemplate, "NumberOfTeenagers");
								vNumberOfChildren = tcOnServer.cmGetAttributeByRef(vAccommodationTemplate, "NumberOfChildren");
								NumberOfKeys = vNumberOfAdults + vNumberOfTeenagers + vNumberOfChildren;
							EndIf;
						EndIf;
					EndIf;
				EndIf;
			EndIf;
		EndIf; 
		
		If vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Orbita5X")
			Or vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.proUSB")
			Or vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.NORWEQMF") Then
			Items.DelKey.Visible = True;
			Items.DelKey.Enabled = True;
		EndIf; 
		
		If vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.HSU") Or 
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OmniTec") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Xeeder") Then
			Items.Cancel.Visible = True;
			Items.Cancel.Enabled = True;
		EndIf;
		
		If vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Adel") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Bonwin") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.BonwinAutonomous") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.iLocks") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Locstar") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.NORWEQMF") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Orbita4X") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.Orbita5X") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.OZLocks") Or
			vDoorLockSystemType = PredefinedValue("Enum.DoorLockSystems.proUSB") Then
			Items.FormInstall.Visible = True;
			Items.FormInstall.Enabled = True;
		EndIf;	
		
		// Set availability of the door lock system authorizations
		vAllowDynamicAuthorizations = tcOnServer.cmGetAttributeByRef(DoorLockSystem, "AllowDynamicAuthorizations");
		Items.DoorLockSystemAuthorization.Enabled = False;
		Items.DoorLockSystemAuthorization.Visible = False;
		If vAllowDynamicAuthorizations Then
			If tcOnServer.cmCheckUserPermissionsAtServer("HavePermissionToSetDoorLockSystemAuthorizations") Then
				Items.DoorLockSystemAuthorization.Visible = True;
				Items.DoorLockSystemAuthorization.Enabled = True;
			EndIf;
		EndIf;
		If Not tcOnServer.cmCheckUserPermissionsAtServer("HavePermissionToChangeCheckOutDateInDoorLockSystem") Then
			Items.CheckOutDate.ReadOnly = True;
		Else
			Items.CheckOutDate.ReadOnly = False;
		EndIf;
		// Show status
		ShowStatusMessage(NStr("en='Choose action';ru='Выберите действие';de='Wählen Sie die Aktion'"));
	Else
		// Show status
		ShowStatusMessage(NStr("en='Door lock system connection is not configured for this workstation!';
		|ru='На этом рабочем месте не настроено подключение к замковой системе!';
		|de='Dieser Arbeitsplatz ist nicht für die Verbindung mit der Schließanlage konfiguriert!'"));
	EndIf;
EndProcedure // OnOpen

// --------------------------------------------------------------------------------
&AtClient
Procedure ExternalEvent(pSource, pEvent, pData)
	If Not IsInputAvailable() Then
		Return;
	EndIf;
	
	vEventData = tcConnectionHardwareAtClient.cmGetExternalEventResultInputDevice(pSource, pEvent, pData);
	If IsBlankString(vEventData.DeviceData) Then
		Return;
	EndIf;
	
	If vEventData.DeviceType = "MagneticStripeCardReader" Then
		vDeviceArr = IsReadyToIssueKeyCards();
		If TypeOf(vDeviceArr) <> Type("Structure") Then
			Return;
		EndIf;
		
		vParameters = New Structure("Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard", Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard);
		vRC = vDeviceArr.Modul.pmRegisterNewCard(vEventData.DeviceData, False, vParameters);
		If ValueIsFilled(vParameters.IdentificationCard) Then
			IdentificationCard = vParameters.IdentificationCard;
			ShowStatusMessage(NStr("en='Input number of keys and choose action';ru='Укажите кол-во карт и выберите действие';de='Geben Sie die Menge der Karten an und wählen Sie eine Aktion aus'"));
		Else
			vErrorDescription = vDeviceArr.Modul.pmGetErrorDescription(vRC, vDeviceArr.SystemName);
			ShowStatusMessage(NStr("en='Error registering identification card! ';ru='Ошибка при регистрации карты идентификации! ';de='Error registering identification card! '") + vErrorDescription, True);
		EndIf;
	EndIf;
EndProcedure // ExternalEvent

#EndRegion

#Region FormHeaderItemsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure CheckOutDateStartChoice(pItem, pChoiceData, pStandardProcessing)
	pStandardProcessing = False;
	vDate = BegOfDay(CheckOutDate);
	ShowInputDate(New NotifyDescription("AfterEnteringTheDate", ThisForm), vDate, NStr("ru='Введите дату';en='Enter date';de='Datum eingeben'"), DateFractions.Date);
EndProcedure // CheckOutDateStartChoice

#EndRegion

#Region FormCommandsEventHandlers

// --------------------------------------------------------------------------------
&AtClient
Procedure NewKey(pCommand)
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		If Not CheckPermissionsToIssueKeyCards() Then
			Return;
		EndIf;
		vIndex = 1;
		ShowStatusMessage(NStr("ru='Приложите ключ для гостя №'; en='Put a key for the guest #'; de='Legte einen schlüssel für den Gast #'")+String(vIndex)+" ("+tcOnServer.cmGetAttributeByRef(Guest, "FullName")+")");
		vParameters = New Structure("Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard", Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard);
		vErrorMessage = "";
		vNumberOfIterations = 1;
		If Items.NumberOfKeys.Visible And NumberOfKeys > 1 Then
			If vDeviceArr.SystemName <> "Kaba Ilco" And 
				vDeviceArr.SystemName <> "Kaba Saflok" And 
				vDeviceArr.SystemName <> "Locstar" And 
				vDeviceArr.SystemName <> "Novilock" And 
				vDeviceArr.SystemName <> "Onity HT22" And 
				vDeviceArr.SystemName <> "Onity HT24" And 
				vDeviceArr.SystemName <> "Onity HT28" And 
				vDeviceArr.SystemName <> "Salto Hotel" And 
				vDeviceArr.SystemName <> "VingCard Vision" And
				vDeviceArr.SystemName <> "Visionline (AssaAbloy)" And 
				vDeviceArr.SystemName <> "TimeLox 2300" Then 
				vNumberOfIterations = NumberOfKeys;
			EndIf;
		EndIf;
		i = 0;
		While i < vNumberOfIterations Do
			If i = 0 Then
				vErrorCode = vDeviceArr.Modul.pmNewKey(vDeviceArr, vParameters, vErrorMessage);
			Else
				vErrorCode = vDeviceArr.Modul.pmAddKey(vDeviceArr, vParameters, vErrorMessage);
			EndIf;
			If vErrorCode <> 0 Then
				If vErrorCode = -1 Then
					ShowStatusMessage(NStr("en='Connection error! ';ru='Ошибка подключения! ';de='Anschlussfehler! '") + vErrorCode + " - " + ?(IsBlankString(vErrorMessage), vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName), vErrorMessage), True);
				Else	
					ShowStatusMessage(NStr("en='Error issuing key card: ';ru='Ошибка выдачи карты: ';de='Fehler bei der Kartenausstellung: '") + vErrorCode + " - " + ?(IsBlankString(vErrorMessage), vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName), vErrorMessage), True);
				EndIf;
				Break;
			Else
				i = i + 1;
				If i < vNumberOfIterations Then
					ShowMessageBox(, NStr("en = 'Use the next key card...'; de = 'Verwenden Sie die nächste Schlüsselkarte...'; ru = 'Используйте следующую ключ-карту...'"), 2);
					WaitOnServer(1);
				Else
					If vDeviceArr.SystemName = "TimeLox 2300" Then 
						ShowMessageBox(New NotifyDescription("pmCloseForm", ThisObject), NStr("en = 'Insert the key card into the encoder'; de = 'Setzen Sie die Schlüsselkarte in den Encoder ein'; ru = 'Вставьте ключ-карту в энкодер'"), 4);
					Else
						ShowMessageBox(New NotifyDescription("pmCloseForm", ThisObject), NStr("en='Success';ru='Успешно';de='Erfolgreich'"), 4);
					EndIf;
				EndIf;
			EndIf;
		EndDo;
	EndIf;
EndProcedure // NewKey

// --------------------------------------------------------------------------------
&AtClient
Procedure AddKey(pCommand)
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		If Not CheckPermissionsToIssueKeyCards() Then
			Return;
		EndIf;
		vIndex = 1;
		ShowStatusMessage(NStr("ru='Приложите ключ для гостя №'; en='Put a key for the guest #'; de='Legte einen schlüssel für den Gast #'")+String(vIndex)+" ("+tcOnServer.cmGetAttributeByRef(Guest, "FullName")+")");
		vParameters = New Structure("Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard", Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard);
		vErrorMessage = "";
		vNumberOfIterations = 1;
		If Items.NumberOfKeys.Visible And NumberOfKeys > 1 Then
			If vDeviceArr.SystemName <> "Kaba Ilco" And 
				vDeviceArr.SystemName <> "Kaba Saflok" And 
				vDeviceArr.SystemName <> "Locstar" And 
				vDeviceArr.SystemName <> "Novilock" And 
				vDeviceArr.SystemName <> "Onity HT22" And 
				vDeviceArr.SystemName <> "Onity HT24" And 
				vDeviceArr.SystemName <> "Onity HT28" And 
				vDeviceArr.SystemName <> "Salto Hotel" And 
				vDeviceArr.SystemName <> "VingCard Vision" And
				vDeviceArr.SystemName <> "Visionline (AssaAbloy)" And 
				vDeviceArr.SystemName <> "TimeLox 2300" Then 
				vNumberOfIterations = NumberOfKeys;
			EndIf;
		EndIf;
		i = 0;
		While i < vNumberOfIterations Do
			vErrorCode = vDeviceArr.Modul.pmAddKey(vDeviceArr, vParameters, vErrorMessage);
			If vErrorCode <> 0 Then
				If vErrorCode = -1 Then
					ShowStatusMessage(NStr("en='Connection error! ';ru='Ошибка подключения! ';de='Anschlussfehler! '") + vErrorCode + " - " + ?(IsBlankString(vErrorMessage), vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName), vErrorMessage), True);
				Else	
					ShowStatusMessage(NStr("en='Error issuing key card: ';ru='Ошибка выдачи карты: ';de='Fehler bei der Kartenausstellung: '") + vErrorCode + " - " + ?(IsBlankString(vErrorMessage), vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName), vErrorMessage), True);
				EndIf;
				Break;
			Else
				i = i + 1;
				If i < vNumberOfIterations Then
					ShowMessageBox(, NStr("en = 'Use the next key card...'; de = 'Verwenden Sie die nächste Schlüsselkarte...'; ru = 'Используйте следующую ключ-карту...'"), 2);
					WaitOnServer(1);
				Else
					If vDeviceArr.SystemName = "TimeLox 2300" Then 
						ShowMessageBox(New NotifyDescription("pmCloseForm", ThisObject), NStr("en = 'Insert the key card into the encoder'; de = 'Setzen Sie die Schlüsselkarte in den Encoder ein'; ru = 'Вставьте ключ-карту в энкодер'"), 4);
					Else
						ShowMessageBox(New NotifyDescription("pmCloseForm", ThisObject), NStr("en='Success';ru='Успешно';de='Erfolgreich'"), 4);
					EndIf;
				EndIf;
			EndIf;
		EndDo;
	EndIf;
EndProcedure // AddKey

// --------------------------------------------------------------------------------
&AtClient
Procedure Install(pCommand)
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		vDeviceArr.Modul.pmInstall();
	EndIf;
EndProcedure // Install

// --------------------------------------------------------------------------------
&AtClient
Procedure Verify(pCommand)
	Var vCardData;
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		vIndex = 1;
		ShowStatusMessage(NStr("ru='Приложите проверяемую карту'; en='Put a card to be checked'; de='Befestigen Sie die zu überprüfende Karte'"));
		vParameters = New Structure("Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard", Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard);
		vErrorCode = vDeviceArr.Modul.pmVerify(vCardData, vDeviceArr, vParameters);
		If vErrorCode <> 0 Then
			ShowStatusMessage(NStr("en='Error issuing key card: ';ru='Ошибка выдачи карты: ';de='Fehler bei der Kartenausstellung: '") + vErrorCode + " - " + vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName), True);
		ElsIf TypeOf(vCardData) = Type("Structure") Then
			If vCardData.ReplyType = "Message" Then
				ShowStatusMessage(vCardData.ReplyDescription, True);
			Else
				vMsg = TrimAll(vCardData.IsCardValidDescription) + Chars.LF + 
				NStr("en='Room: '; ru='Номер: '; de='Zimmer: '") + String(vCardData.CardRoom) + 
				NStr("en=', Guest: '; ru=', Гость: '; de=', Gast: '") + String(vCardData.CardFullName) + Chars.LF + 
				NStr("en='Check-in: '; ru='Заезд: '; de='Anreise: '") + Format(vCardData.CardCheckInDate, "DF='dd.MM.yyyy HH:mm'") + 
				NStr("en=', check-out: '; ru=', выезд: '; de=', abreise: '") + Format(vCardData.CardCheckOutDate, "DF='dd.MM.yyyy HH:mm'");
				ShowStatusMessage(vMsg);
			EndIf;
		EndIf;
	EndIf;
EndProcedure // Verify

// --------------------------------------------------------------------------------
&AtClient
Procedure DelKey(pCommand)
	Var vCardData;
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		vIndex = 1;
		ShowStatusMessage(NStr("ru='Приложите проверяемую карту'; en='Put a card to be checked'; de='Befestigen Sie die zu überprüfende Karte'"));
		vErrorCode = vDeviceArr.Modul.pmDelete(vDeviceArr);
		If vErrorCode <> 0 Then
			ShowStatusMessage(NStr("en='Card deletion error: ';ru='Ошибка удаления карты: ';de='Fehler beim löschen der Karte: '") + vErrorCode + " - " + vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName));
		Else
			ShowStatusMessage(NStr("en='Card deleted';ru='Карта удалена';de='Karte gelöscht'"));	
		EndIf;
	EndIf;
EndProcedure

#EndRegion

#Region Private

// --------------------------------------------------------------------------------
&AtServer
Procedure ShowStatusMessage(pMsg = "", pAttention = False)
	HelpMessage = pMsg;
	If pAttention Then
		Items.HelpMessage.TextColor = WebColors.Red;
	Else
		Items.HelpMessage.TextColor = WebColors.Black;
	EndIf;
EndProcedure // ShowStatusMessage

// --------------------------------------------------------------------------------
&AtClient
Function IsReadyToIssueKeyCards()
	vDriver = Undefined;
	vCurWstn = tcOnServer.cmGetSessionParametersAttribute("CurrentWorkstation");
	If ValueIsFilled(vCurWstn) Then
		vCurWstnArr = tcOnServer.cmGetAtributeAsArray(vCurWstn);
		If ValueIsFilled(DoorLockSystem) Then
			vDevice = DoorLockSystem;
		Else	
			ShowMessageBox(,Nstr("en='Door lock system is not configurated properly for the current workstation!';ru='Система электронных замков на данном рабочем месте не настроена!';de='Das System für elektronische Schlösser ist auf diesem Arbeitsplatz nicht eingestellt!'"),,NStr("en = 'ERROR'; ru = 'ОШИБКА'; de = 'ERROR'"));
			Return False;
		EndIf;
		
		vDriver = tcOnClient.cmGetModulTO(vDevice);
	Else
		ShowMessageBox(,Nstr("en = 'The workstation is not defined'; ru = 'Рабочее место не определено'; de = 'Die Workstation ist nicht definiert'"),,NStr("en = 'ERROR'; ru = 'ОШИБКА'; de = 'ERROR'"));
		Return  False;
	EndIf;
	If Not vDriver = Undefined Then
		Return vDriver;
	Else
		ShowMessageBox(,Nstr("en = 'Work with this device is not supported'; ru = 'Работа с драйвером этого устройства не поддерживается'; de = 'Die Arbeit mit diesem Gerät nicht unterstützt wird'"),,NStr("en = 'ERROR'; ru = 'ОШИБКА'; de = 'ERROR'"));
	EndIf;	
	Return  False;
EndFunction // IsReadyToIssueKeyCards

// --------------------------------------------------------------------------------
&AtServer
Function CheckPermissionsToIssueKeyCards()
	vBalances = cmGetClientRoomBalances(New Boundary(BegOfDay(CheckOutDate), BoundaryType.Excluding), Room, Guest);
	For Each vBalancesRow In vBalances Do
		If (vBalancesRow.ClientSumBalance + vBalancesRow.ClientLimitBalance) > 0 Then
			vMessage = NStr("en='Client has debt on " + Format(CheckOutDate, "DF='dd.MM.yyyy HH:mm'") + " date for the " + TrimAll(Room) + " room!'; 
			|de='Kunde hat Schulden am " + Format(CheckOutDate, "DF='dd.MM.yyyy HH:mm'") + " Datum für das " + TrimAll(Room) + " Zimmer!'; 
			|ru='На дату " + Format(CheckOutDate, "DF='dd.MM.yyyy HH:mm'") + " у гостя в номере " + TrimAll(Room) + " есть задолженность!'");
			If Not cmCheckUserPermissions("HavePermissionToIssueKeyCardsForGuestsWithDebtsOnKeyValidToDate") Then
				WriteLogEvent(NStr("en='DoorLockSystem.Error';ru='СистемаЭлектронныхЗамков.Ошибка';de='DoorLockSystem.Error'"), EventLogLevel.Warning, , Guest, vMessage);
				tcCommonFunctionOnClientServer.UserMessage(vMessage);
				Return False;
			Else
				// User activity history   
				vEventDescription = NStr("en = 'Issue of a key without payment'; de = 'Schlüsselübergabe ohne Bezahlung'; ru = 'Выдача ключа без оплаты'") + Chars.LF + vMessage;
				InformationRegisters.UserActionsHistory.WriteUserActivityRecord(ParentDoc, vEventDescription);
				Break;
			EndIf;
		EndIf;
	EndDo;
	If Not cmCheckUserPermissions("HavePermissionToIssueKeyCardsForGuestsWithDebtsOnKeyValidToDate") Then
		If ValueIsFilled(AccommodationType) Then
			If AccommodationType.Type = Enums.AccomodationTypes.AdditionalBed Or
				AccommodationType.Type = Enums.AccomodationTypes.Together Then
				vMessage = NStr("en='You do not have rights to issue keys to guests with " + TrimAll(AccommodationType) + " accommodation type! Operation will be canceled!'; 
				|de='Sie haben kein Recht, den Schlüssel an Gäste mit der Art der Unterkunft " + TrimAll(AccommodationType) + " auszugeben! Operation wird abgesagt!'; 
				|ru='Нет прав выписывать ключи гостям с видом размещения " + TrimAll(AccommodationType) + "! Операция будет отменена!'");
				WriteLogEvent(NStr("en='DoorLockSystem.Error';ru='СистемаЭлектронныхЗамков.Ошибка';de='DoorLockSystem.Error'"), EventLogLevel.Warning, , Guest, vMessage);
				tcCommonFunctionOnClientServer.UserMessage(vMessage);
				Return False;
			EndIf;
		EndIf;
	EndIf;
	If ValueIsFilled(Folio) And Folio.IsClosed Then
		vMessage = TrimAll(Guest) + ", " + TrimAll(Room) + ", " + Format(CheckInDate, "DF='dd.MM.yyyy HH:mm'") + " - " + Format(CheckOutDate, "DF='dd.MM.yyyy HH:mm'");
		// User activity history   
		vEventDescription = NStr("en = 'Request a key for a closed folio'; de = 'Fordern Sie einen Schlüssel für ein geschlossenes Folio an'; ru = 'Запрос на выдачу ключа по закрытому фолио'") + Chars.LF + vMessage;
		InformationRegisters.UserActionsHistory.WriteUserActivityRecord(ParentDoc, vEventDescription);
	EndIf;
	
	Return True;
EndFunction // CheckPermissionsToIssueKeyCards

// --------------------------------------------------------------------------------
&AtClient
Procedure pmCloseForm(pAdditionalParameters) Export
	Close();
EndProcedure // pmCloseForm

// --------------------------------------------------------------------------------
&AtClient
Procedure AfterEnteringTheDate(pDate, pExtra) Export 
	vTime = CheckOutDate;
	ShowInputDate(New NotifyDescription("AfterEnteringTheTime", ThisForm, New Structure("Date", pDate)), vTime, NStr("ru='Введите время';en='Enter time';de='Zeit eingeben'"), DateFractions.Time);
EndProcedure // AfterEnteringTheDate

// --------------------------------------------------------------------------------
&AtClient
Procedure AfterEnteringTheTime(pTime, pExtra) Export 
	vOldCheckOutDate = CheckOutDate; 
	If pTime = Undefined And pExtra.Date = Undefined Then
		Return;
	ElsIf pExtra.Date <> Undefined And pTime <> Undefined Then
		CheckOutDate = BegOfDay(pExtra.Date) + (pTime - BegOfDay(pTime));
	ElsIf pExtra.Date <> Undefined And pTime = Undefined Then
		vTeme = CheckOutDate - BegOfDay(CheckOutDate);  
		CheckOutDate = BegOfDay(pExtra.Date) + vTeme;
	ElsIf pExtra.Date = Undefined And pTime <> Undefined Then
		vDate = BegOfDay(CheckOutDate);
		CheckOutDate = vDate + (pTime - BegOfDay(pTime));
	EndIf;
	If CheckOutDate < CheckInDate Then
		CheckOutDate = vOldCheckOutDate;
		ShowMessageBox(,NStr("ru='Дата выезда не может быть раньше заезда';en='Departure date cannot be earlier than arrival';de='Das Abreisedatum kann nicht vor der Ankunft liegen'"));
	EndIf;
EndProcedure // AfterEnteringTheTime

// --------------------------------------------------------------------------------
&AtServerNoContext
Function GetDoorLockSystems(pWorkstation, pRoom)
	vDoorLockSystemsArray = New Array();
	
	vQry = New Query; 
	vQry.Text = "SELECT
	|	ConnectedDevices.DeviceSettings AS DeviceSettings
	|FROM
	|	InformationRegister.ConnectedDevices AS ConnectedDevices
	|WHERE
	|	ConnectedDevices.Workstation = &qCurrentWorkstation
	|	AND ConnectedDevices.DeviceType = &qDeviceType
	|	AND ConnectedDevices.IsActive";
	vQry.SetParameter("qCurrentWorkStation", pWorkstation);
	vQry.SetParameter("qDeviceType", Enums.DeviceTypes.DoorLockSystemParameters);
	vResult = vQry.Execute().Unload();
	For Each vRow In vResult Do
		If ValueIsFilled(pRoom.DoorLockSystemType) Then
			If vRow.DeviceSettings.DoorLockSystemType = pRoom.DoorLockSystemType Then 
				vDoorLockSystemsArray.Add(vRow.DeviceSettings);
			EndIf;
		Else
			vDoorLockSystemsArray.Add(vRow.DeviceSettings);
		EndIf;
	EndDo;
	
	Return vDoorLockSystemsArray;
EndFunction // GetDoorLockSystems

// -----------------------------------------------------------------------------
&AtServerNoContext
Function GetDataProcessorName(pDataProcessor)
	Return Catalogs.DataProcessors.GetNameDataProcessorByProcessing(pDataProcessor);
EndFunction // GetDataProcessorName

// -----------------------------------------------------------------------------
&AtServerNoContext
Procedure WaitOnServer(pSec) 
	cmWait(pSec);
EndProcedure // WaitOnServer

// -----------------------------------------------------------------------------
&AtClient
Procedure Cancel(pCommand)
	Var vCardData;
	vParameters = New Structure("Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard", Room, CheckInDate, CheckOutDate, Guest, ParentDoc, Folio, FolioNumber, AccommodationType, DoorLockSystemAuthorization, NumberOfKeys, IdentificationCard);
	vDeviceArr = IsReadyToIssueKeyCards();
	If TypeOf(vDeviceArr) = Type("Structure") Then
		vIndex = 1;
		ShowStatusMessage(NStr("ru='Приложите проверяемую карту'; en='Put a card to be checked'; de='Befestigen Sie die zu überprüfende Karte'"));
		vErrorCode = vDeviceArr.Modul.pmCancel(vDeviceArr,vParameters);
		If vErrorCode <> 0 Then
			ShowStatusMessage(NStr("en='Card deletion error: ';ru='Ошибка удаления карты: ';de='Fehler beim löschen der Karte: '") + vErrorCode + " - " + vDeviceArr.Modul.pmGetErrorDescription(vErrorCode, vDeviceArr.SystemName));
		Else
			ShowStatusMessage(NStr("en='Card deleted';ru='Карта удалена';de='Karte gelöscht'"));	
		EndIf;
	EndIf;
EndProcedure // Cancel

#EndRegion
